{
  "recipes": [
    {
      "title": "Avocado Pasta",
      "ingredients": [
        "1 ripe avocado",
        "Juice from 1/2 lemon",
        "2-3 cloves of garlic",
        "1/2 tsp salt",
        "2 tbsp Extra Virgin olive oil",
        "200g pasta/noodles, I used Tripoline",
        "Fresh black pepper"
      ],
      "steps": [
        "Cook your pasta according to the instructions on the pack.",
        "While it's cooking, scoop out the avocado into a food processor, add the lemon juice, garlic, salt &amp; oil and mix until creamy- if you don't have a food processor you could use a fork to mash the avocado and then just mix it together with crushed garlic and the salt, lemon &amp; oil.",
        "Taste and adjust the seasoning if needed then when the pasta is ready, combine the two together and plate up.",
        "Add some freshly ground black pepper and some lemon zest if you fancy and then tuck in."
      ],
      "id": "1",
      "tags": [],
      "active": true,
      "updated": "2014-12-16T19:30:10.463Z"
    },
    {
      "id": "23",
      "title": "Banana Bread",
      "ingredients": [
        "1 1/2 cups white flour",
        "1 cup sugar",
        "1 1/2 tsp baking soda",
        "4 tbsp butter or vegetable oil",
        "3-4 ripe bananas, mashed",
        "2 tbsp applesauce",
        "a handful of raisins",
        "a handful of pecan pieces"
      ],
      "steps": [
        "Preheat oven to 350 degrees.",
        "Make sure your bananas are mashed until there are very few lumps. Try not to puree though, because that makes the bread less fluffy.",
        "Sift together your dry ingredients until they are well mixed.",
        "Mix all of the ingredients together except the raisins and pecans.",
        "Cover the raisins and pecan pieces with a light dusting of flour to ensure that they don’t sink to the bottom of the pan.",
        "Pour the batter into a buttered 9×11 cake pan.",
        "Bake at 350 degrees for about 55-60 minutes or until chocolate brown and cooked all the way through."
      ],
      "active": true,
      "updated": "2014-12-16T19:28:21.178Z"
    },
    {
      "id": "24",
      "title": "Barley Stew with Leeks, Mushrooms, and Greens",
      "ingredients": [
        "1 tablespoon olive oil, divided",
        "1 1/2 cups chopped leeks (about 2 small stalks; white and pale green parts only)",
        "1 8-ounce container sliced crimini (baby bella) mushrooms",
        "2 garlic cloves, pressed",
        "2 1/4 teaspoons minced fresh rosemary",
        "1 14.5-ounce can diced tomatoes in juice",
        "1 cup pearl barley",
        "4 cups (or more) vegetable broth",
        "1 bunch kale (about 8 ounces), trimmed, center stalks removed, leaves coarsely chopped (about 8 cups packed)",
        ""
      ],
      "steps": [
        "Heat oil in heavy large pot over medium heat.",
        "Add leeks; sprinkle with salt and pepper and sauté until leeks begin to soften, stirring often, about 5 minutes.",
        "Add mushrooms, garlic, and rosemary; increase heat to medium-high and sauté until mushrooms soften and begin to brown, stirring often, about 7 minutes.",
        "Add tomatoes with juice; stir 1 minute.",
        "Add barley and 4 cups broth; bring to boil.",
        "Reduce heat to low, cover, and simmer until barley is almost tender, about 20 minutes.",
        "Add kale; stir until wilted, about 1 minute.",
        "Cover and simmer until kale and barley are tender, adding more broth by 1/4 cupfuls as needed for desired stew consistency, about 10 minutes.",
        ""
      ],
      "modified": "2014-08-24T06:45:37.833Z",
      "tags": [],
      "active": true,
      "updated": "2014-12-16T07:58:47.397Z"
    },
    {
      "id": "26",
      "title": "Black Beans and Rice",
      "ingredients": [
        "1 cup uncooked white rice",
        "1 Tbsp olive oil",
        "1 small onion, chopped",
        "1/2 green bell pepper, thinly sliced",
        "1/2 red bell pepper, thinly sliced (for added flavor you can substitute roasted red bell peppers or some chopped pimentos)",
        "3 cloves minced garlic",
        "2 16-ounce cans of black beans, rinsed and drained",
        "2 Tbsp white vinegar",
        "A few dashes of Tabasco or 1/4 teaspoon cayenne powder",
        "1 teaspoon dried oregano or 1 heaping Tbsp chopped fresh oregano",
        "Salt and pepper to taste",
        "Lime wedges and cilantro for garnish"
      ],
      "steps": [
        "Cook rice according to package instructions. White rice usually takes 15 minutes to cook once the water is simmering, and 10 minutes to sit.",
        "Heat oil in a large skillet on medium high.",
        "Sauté onions and bell peppers for 3-4 minutes, until just beginning to soften, then add garlic and sauté a minute more.",
        "Add the black beans, vinegar and Tabasco or cayenne. Bring to a boil, reduce heat, cover and simmer for 5 minutes."
      ],
      "modified": "2014-08-24T06:45:49.482Z",
      "tags": [],
      "active": true,
      "updated": "2014-12-16T19:32:35.021Z"
    },
    {
      "id": "80",
      "title": "Steel-Cut Oats",
      "ingredients": [
        "1 teaspoon butter or olive oil",
        "1 cup steel-cut oats",
        "3 cups water",
        "3-fingered pinch salt",
        "1 cup milk"
      ],
      "steps": [
        "Start this the night before you want to have steel-cut oatmeal. Measure out your oats. This quantity will make about 4 servings.",
        "Heat about 1 teaspoon butter or olive oil in a 2-quart saucepan set over medium heat. Add the oats and fry them for about 3 minutes, or until they start smelling toasty.",
        "Pour in the water and add the salt. Stir.",
        "Bring to a rolling boil.",
        "Turn off the heat and cover the pan. Leave it on the stove, and go to bed!",
        "The next morning, uncover the pan and bring the oatmeal back up to a simmer. If you would like thinner and creamier oatmeal, stir in a cup of milk before reheating."
      ],
      "modified": "2014-08-07T08:05:39.622Z",
      "tags": [],
      "active": true,
      "updated": "2014-12-16T15:55:11.496Z"
    },
    {
      "id": "2",
      "title": "Dhaba Dal",
      "ingredients": [
        "1/2 cup dried urad dal (split black lentils), with skin on",
        "1/2 cup chana dal (split bengal gram)",
        "1/4 cup dried rajma (kidney beans)",
        "1 tbsp ginger/garlic paste",
        "1 cup finely chopped yellow onion",
        "2 serrano or thai chilis, split in half",
        "1 cup finely chopped tomatoes",
        "1 tbsp tomato paste",
        "1 tsp red chili powder",
        "2 tsp fresh cumin powder",
        "1 tsp turmeric",
        "1 tbsp kasuri methi (dried fenugreek leaves)",
        "1/4 cup chopped cilantro",
        "2 tbsp vegetable oil, or ghee",
        "2 tbsp salt (more/less to taste)"
      ],
      "steps": [
        "Clean, wash, and soak the urad dal, chana dal, and rajma in 6 cups water overnight (or at least 6 hours).",
        "Drain the soaked dals and rajma. Add 5 cups water and pressure cook for 15 to 20 minutes, or until the dals are completely cooked. If not using a pressure cooker, cook on stove top in a large thick-bottomed pan, covered. You want the dals (and rajma) to be completely cooked, otherwise the texture of the finished dal suffers.",
        "Heat the oil. Add the ginger/garlic paste, onions, and green chilis. Saute for 5 minutes, till the onions are slightly pulpy and golden brown in color. Add the turmeric, chili powder, and cumin powder, and saute for 1-2 minutes more.",
        "Add the tomatoes and tomato paste. Cook over a high flame till the tomatoes get mushy, approx. 5 minutes.",
        "Add the cooked dals with the cooking water (if you have too much water, reserve some. You can always add it back later, but overly-thin dal is not good). Mix well, add the kasuri methi, and simmer for 10 minutes.",
        "Add the cilantro, heat another minute or so, and serve with roti and/or rice."
      ],
      "active": true
    },
    {
      "id": "3",
      "title": "Srikhand",
      "ingredients": [
        "1-1/2 to 2 cups Greek Yogurt",
        "2 tbsp milk, warmed",
        "Generous pinch of saffron threads",
        "1/4-1/2 cups sugar (or as per taste)",
        "Pinch of nutmeg",
        "Pinch of cardamom powder or as per taste",
        "About 1 tbsp charoli nuts to garnish"
      ],
      "active": true
    }
  ]
}